let a = 1 * "4" + +null + +" " - "5" * 2 + +(7 + 2 + "" + +!!undefined);
/* `1 * '4': การคูณตัวเลข 1 กับ String '4' ทำให้ String '4' ถูกแปลงเป็นตัวเลข 4, ผลลัพธ์คือ 4.
+null: การแปลง null เป็นตัวเลข, ผลลัพธ์คือ 0.
+' ': การแปลง String ว่างเป็นตัวเลข, ผลลัพธ์คือ 0.
'5' * 2: การคูณ String '5' กับ 2 ทำให้ String '5' ถูกแปลงเป็นตัวเลข 5, ผลลัพธ์คือ 10.
+(7 + 2 + '' + +!!undefined): การดำเนินการต่อกัน:
7 + 2: การบวกเลข, ผลลัพธ์คือ 9.
'' + +!!undefined: การเชื่อมต่อกับ String ว่างและการแปลง undefined เป็น boolean (ผลลัพธ์จะเป็น false และแปลงเป็น 0), ผลลัพธ์คือ String 'false0'.
+(7 + 2 + '' + +!!undefined): การแปลง String 'false0' เป็นตัวเลข, ผลลัพธ์คือ 0. */
//let a = 4 + 0 + 0 - 10 + 0;
// ลลัพธ์สุดท้ายของ a คือ -6.
console.log(a)