console.log('1' > 4);            // ผลลัพธ์: false (String '1' ถูกแปลงเป็นตัวเลข 1)
console.log('' <= 1);             // ผลลัพธ์: true (String ว่างถูกแปลงเป็นตัวเลข 0)
console.log('apple' > 'pineapple'); // ผลลัพธ์: false (เปรียบเทียบตามลำดับอักษร)
console.log(undefined == null);   // ผลลัพธ์: true (มีค่าเท่ากันเมื่อใช้ ==)
console.log(undefined === null);  // ผลลัพธ์: false (มีค่าไม่เท่ากันเมื่อใช้ ===)
console.log(NaN !== 2);            // ผลลัพธ์: true (NaN ไม่เท่ากับ 2)
console.log(NaN == NaN);           // ผลลัพธ์: false (NaN ไม่เท่ากับตัวมันเอง)
console.log(NaN === NaN);          // ผลลัพธ์: false (NaN ไม่เท่ากับตัวมันเอง, และใช้ ===)

/* สามารถสรุปได้ว่า:
>' ตรวจสอบว่า '1' ที่แปลงเป็นตัวเลขได้คือ 1 มีค่ามากกว่า 4 หรือไม่ ซึ่งเป็นเท็จ
<=' ตรวจสอบว่า '' ที่แปลงเป็นตัวเลขได้คือ 0 น้อยกว่าหรือเท่ากับ 1 หรือไม่ ซึ่งเป็นจริง
>'apple' ตรวจสอบว่า 'apple' มีค่ามากกว่า 'pineapple' หรือไม่ ซึ่งเป็นเท็จ (เปรียบเทียบตามลำดับอักษร)
== และ === ตรวจสอบว่า undefined เท่ากับ null หรือไม่ ซึ่งเป็นจริงเมื่อใช้ == และเป็นเท็จเมื่อใช้ ===
!== ตรวจสอบว่า NaN ไม่เท่ากับ 2 หรือไม่ ซึ่งเป็นจริง
== ตรวจสอบว่า NaN เท่ากับ NaN หรือไม่ ซึ่งเป็นเท็จ
=== ตรวจสอบว่า NaN เท่ากับ NaN หรือไม่ ซึ่งเป็นเท็จ (เนื่องจาก NaN ไม่เท่ากับตัวมันเอง) */